In [1]:
# 엑셀파일 읽기
import pandas as pd

In [ ]:
%pip install pandas openpyxl xlrd

In [ ]:
# pd.read_excel('./lotto_1193.xls',engine='xlrd')
table = pd.read_html('./lotto_1193.xls')
lotto_df = table[1].loc[2:, 13:]
lotto_df = lotto_df[::-1]
lotto_df = lotto_df.reset_index(drop=True)
lotto_df

In [ ]:
# 0:2 2
# 1:3 3
# 2:4 4 
# ....
# ?:len(x)

   13  14  15  16  17  18  19
1  10  16  23  36  39  40  11
2   1   4  11  12  20  41   2

In [31]:
lotto_df[ len(lotto_df)-1 : len(lotto_df)]

    13  14  15  16  17  18  19
592  2  16  19  31  34  35  37

In [33]:
lotto_df.tail()

     13  14  15  16  17  18  19
588   1   2   7   9  10  38  42
589   2   6  18  21  33  34  30
590   2  19  25  26  27  43  28
591  13  14  22  27  30  38   2
592   2  16  19  31  34  35  37